backend/research/n2/wrk_multi_history.txt
Running 10s test @ http://localhost:8080/v1/conversations/adf92673-cf09-4ca1-82c3-cacf19593f4c/messages
  8 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    34.74ms   22.26ms 292.55ms   96.60%
    Req/Sec   775.50    178.09     1.06k    63.78%
  Latency Distribution
     50%   31.06ms
     75%   39.86ms
     90%   46.02ms
     99%  157.88ms
  60887 requests in 10.03s, 419.81MB read
Requests/sec:   6070.23
Transfer/sec:     41.85MB